In [2]:
import pandas as pd

---

`.melt()` creates two columns with all the variable names and all the values.

From **wide** to **long** format.

In [3]:
df = pd.DataFrame({'height': [192, 175, 20], 
                   'weight': [82, 70, 7],
                  'age': [23, 20, 14]}, 
                  index=['giulio', 'stella', 'micio'])
df

        height  weight  age
giulio     192      82   23
stella     175      70   20
micio       20       7   14

In [5]:
df.melt(['height'], # <-- the first argument fixes a column and uses it as identifier for the new column `values`
        var_name='var1',
       value_name='val1')

   height    var1  val1
0     192  weight    82
1     175  weight    70
2      20  weight     7
3     192     age    23
4     175     age    20
5      20     age    14

---

`pivot()` is the opposite of `melt()`. It unpacks a single column to multiple columns.

Reshape data (produce a “pivot” table) based on column values.

In [9]:
df = pd.DataFrame({'height': [192, 175, 20], 
                   'weight': [82, 70, 7],
                  'age': [23, 20, 14]}, 
                  index=['giulio', 'stella', 'micio'])
df

        height  weight  age
giulio     192      82   23
stella     175      70   20
micio       20       7   14

In [14]:
df_melt = df.melt(['height'], # <-- the first argument fixes a column and uses it as identifier for the new column `values`
                  var_name='var1',
                  value_name='val1')
df_melt

   height    var1  val1
0     192  weight    82
1     175  weight    70
2      20  weight     7
3     192     age    23
4     175     age    20
5      20     age    14

In [17]:
df_melt.pivot(columns='height', values='val1')

height   20    175   192
0        NaN   NaN  82.0
1        NaN  70.0   NaN
2        7.0   NaN   NaN
3        NaN   NaN  23.0
4        NaN  20.0   NaN
5       14.0   NaN   NaN

In [26]:
df_topivot = pd.DataFrame({
    'name': ['giulio', 'giulio', 'giulio', 'giulio', 'stella', 'stella', 'stella', 'stella'],
    'age': [0, 5, 10, 15, 0, 5, 10, 15],
    'weight': [5, 20, 40, 60, 3, 16, 33, 50]})
df_topivot

     name  age  weight
0  giulio    0       5
1  giulio    5      20
2  giulio   10      40
3  giulio   15      60
4  stella    0       3
5  stella    5      16
6  stella   10      33
7  stella   15      50

In [29]:
df_pivot = df_topivot.pivot(index='name', columns='age', values='weight')
df_pivot

age     0   5   10  15
name
giulio   5  20  40  60
stella   3  16  33  50

---

`.query()` select only the rows from a column that fulfill the query

In [32]:
df_topivot.query('weight>10')

     name  age  weight
1  giulio    5      20
2  giulio   10      40
3  giulio   15      60
5  stella    5      16
6  stella   10      33
7  stella   15      50

In [34]:
# alternatively, one can use a R-like syntax
df_topivot[df_topivot.weight > 10]

     name  age  weight
1  giulio    5      20
2  giulio   10      40
3  giulio   15      60
5  stella    5      16
6  stella   10      33
7  stella   15      50

In [1]:
df_topivot[df_topivot.weight > 10] == df_topivot.query('weight>10')

NameError: name 'df_topivot' is not defined

---

In [11]:
# Concat
df = pd.DataFrame({'height': [192, 175, 20], 
                   'weight': [82, 70, 7],
                  'age': [23, 20, 14]}, 
                  index=['giulio', 'stella', 'micio'])
df

        height  weight  age
giulio     192      82   23
stella     175      70   20
micio       20       7   14

In [7]:
new_column = pd.DataFrame({'BMI': [90, 80, 50]}, index=['giulio', 'stella', 'micio'])
pd.concat([df, new_column], axis=1)

        height  weight  age  BMI
giulio     192      82   23   90
stella     175      70   20   80
micio       20       7   14   50

In [15]:
new_row = pd.DataFrame({'height': [15], 
                        'weight': [4],
                        'age': [3]}, 
                       index=['tinitini'])
pd.concat([df, new_column])

        height  weight   age   BMI
giulio   192.0    82.0  23.0   NaN
stella   175.0    70.0  20.0   NaN
micio     20.0     7.0  14.0   NaN
giulio     NaN     NaN   NaN  90.0
stella     NaN     NaN   NaN  80.0
micio      NaN     NaN   NaN  50.0

---

In [16]:
# Combine datasets
adf = pd.DataFrame({'x1': ['A', 'B', 'C'], 'x2': [1, 2, 3]})
bdf = pd.DataFrame({'x1': ['A', 'B', 'D'], 'x3': ['T', 'F', 'T']})

In [20]:
pd.merge(left=adf, right=bdf, how='left', on='x1')

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [21]:
pd.merge(left=adf, right=bdf, how='right', on='x1')

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [22]:
pd.merge(left=adf, right=bdf, how='inner', on='x1')

  x1  x2 x3
0  A   1  T
1  B   2  F

In [23]:
pd.merge(left=adf, right=bdf, how='outer', on='x1')

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

In [25]:
pd.merge(left=adf, right=bdf, on='x1') # `inner` is the default value for `how`

  x1  x2 x3
0  A   1  T
1  B   2  F

---

In [28]:
# Making new columns
df = pd.DataFrame({'height': [192, 175, 20], 
                   'weight': [82, 70, 7],
                  'age': [23, 20, 14]}, 
                  index=['giulio', 'stella', 'micio'])

In [30]:
df['BMI'] = df.weight / (df.height/100) ** 2
df

        height  weight  age         BMI
giulio     192      82   23   22.243924
stella     175      70   20   22.857143
micio       20       7   14  175.000000

## References
1. `pandas` cheatsheet https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf